import Queue

#Створити чергу заявок
queue = Queue()

def generate_request():
    #Створити нову заявку
    #Додати заявку до черги

def process_request():
    #Якщо черга не пуста:
        #Видалити заявку з черги
        #Обробити заявку
    #Інакше:
        #Вивести повідомлення, що черга пуста

def main():
    while 

Головний цикл програми:
    Поки користувач не вийде з програми:
        Виконати generate_request() для створення нових заявок
        Виконати process_request() для обробки заявок